InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТипыЦен</Name>
			<Comment>Типы цен</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены (для цен не в валюте учета товара)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеУчета</Name>
					<Comment>Признак ведения учета в в валюте учета </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Цена включает НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>Процент наценки или скидки по отношению к базовому типу цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при округлении 0.01 будет округлена до 0.05, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Comment>Количество значащих знаков цены после запятой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Comment>Признак использования в качестве цен закупки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Признак использования в качестве цен продажи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦеныПоПриходу</Name>
					<Comment>Автоматически регистрировать цены по приходу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Признак отображения типа в печатной форме прайс-листа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЦены</Name>
					<Comment>Алгоритм получения цены</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АлгоритмПолученияЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРабот</Name>
					<Comment>Тип цен используется для работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляТоваров</Name>
					<Comment>Тип цен используется для товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтомобилей</Name>
					<Comment>Тип цен используется для автомобилей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентыСкидкиНаценки</Name>
					<Comment>Проценты скидки/наценки от базового типа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьТипНоменклатуры</Name>
							<Comment>Тип номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>Процент скидки/наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПодборТоваровСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДлительныеОперации

// Замены для номенклатуры по артикулу и производителю.
//
// Параметры:
//  Номенклатура - Структура - Описание ключевых полей номенклатуры:
//    Артикул - артикул для поиска номенклатуры См. ПодборТоваровКлиентСервер.ВАртикулДляПоиска.
//  АдресДляСтарыхЗамен - Строка - Адрес во временном хранилище для размещения старых замен номенклатуры.
//  АдресДляНовыхЗамен - Строка - Адрес во временном хранилище для размещения новых замен номенклатуры.
//
Процедура ЗаменыНоменклатуры(Номенклатура, АдресДляСтарыхЗамен, АдресДляНовыхЗамен) Экспорт
	
	ДополнительныеДанные = Неопределено;
	Номенклатура.Свойство("ДополнительныеДанные", ДополнительныеДанные);
	ТаблицаЗамен = ЗаменыСервер.ЗаменыНоменклатурыПоПолям(
		Номенклатура.Артикул,
		Номенклатура.Производитель,
		ДополнительныеДанные);
	ТаблицаЗамен.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(3, 0));
	СтарыеЗамены = ТаблицаЗамен.НайтиСтроки(Новый Структура("Новая", Ложь));
	НовыеЗамены = ТаблицаЗамен.НайтиСтроки(Новый Структура("Новая", Истина));
	ПоместитьВоВременноеХранилище(
		ОбщегоНазначения.ТаблицаЗначенийВМассив(ЗаполнитьНомераСтрок(ТаблицаЗамен.Скопировать(СтарыеЗамены))),
		АдресДляСтарыхЗамен);
	ПоместитьВоВременноеХранилище(
		ОбщегоНазначения.ТаблицаЗначенийВМассив(ЗаполнитьНомераСтрок(ТаблицаЗамен.Скопировать(НовыеЗамены))),
		АдресДляНовыхЗамен);
	
КонецПроцедуры

// Уникальные позиции из спр. Номенклатура, аналогов, замен и прайс-листов.
// Ключ уникальности связка артикул и производитель.
//
// Параметры:
//  ПараметрыПоиска - Структура - Параметры поиска позиций:
//   - Артикул - Строка - Строка поиска по артикулу.
//   - ИспользованиеФильтраПроизводитель - Булево - Признак отбора по производителю.
//   - Производитель - СправочникСсылка.Производители - Фильтр производитель.
//   - ТочныйПоиск - Булево - Признак поиска на равно, а не содержит.
//   - ИскатьВоВнешнихПрайсЛистахКонтрагентов - Булево - Признак необходимости поиска во внешних источниках.
//  АдресРезультата - Строка - Адрес во временном хранилище в которое будет помещен результат выполнения.
//
Процедура ПоискНоменклатуры(ПараметрыПоиска, АдресРезультата) Экспорт
	
	Результат = ПоискВПрайсЛистах.ВыполнитьПоискУникальныхПозиций(
		ПараметрыПоиска.Артикул,
		ПодборТоваровКлиентСервер.ВАртикулДляПоиска(ПараметрыПоиска.Артикул),
		ПараметрыПоиска.Наименование,
		ПараметрыПоиска.ИспользованиеФильтраПроизводитель,
		ПараметрыПоиска.Производитель,
		ПараметрыПоиска);
	
	ПоместитьВоВременноеХранилище(ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат), АдресРезультата);
	
КонецПроцедуры

// ++ siniko

// Цены номенклатуры по подразделению.
//
// Параметры:
//  Параметры - Структура - Описание параметров цен:
//    *Номенклатура - СправочникСсылка.Номенклатура - Номенклатура для которой получаются цены.
//    *ПодразделениеКомпании - СправочникСсылка.ПодразделенияКомпании - Подразделение цены.
//  АдресРезультата - Строка - Адрес во временном хранилище для размещения цен номенклатуры.
//
Процедура ЦеныНоменклатуры(Параметры, АдресРезультата) Экспорт
	
	#Область ТекстЗапроса
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	|	ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ВВалютеУчета = ИСТИНА
	|			ТОГДА ЦеныСрезПоследних.Номенклатура.ВалютаУчета
	|		ИНАЧЕ ЦеныСрезПоследних.ТипЦен.ВалютаЦены
	|	КОНЕЦ КАК ВалютаЦены,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныСрезПоследних.ПодразделениеКомпании КАК Подразделение,
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	0 КАК ЦенаРегл
	|ПОМЕСТИТЬ ТаблицаЦен
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&НаДату,
	|			ПодразделениеКомпании В(&СписокПодразделений)
	|			И Номенклатура = &Номенклатура
	|				И Контрагент = &Контрагент) КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Цена > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.ВалютаЦены КАК ВалютаЦены,
	|	ТаблицаЦен.ВалютаЦены КАК БазоваяВалюта,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.Подразделение КАК Подразделение,
	|	ТаблицаЦен.Цена КАК Цена,
	|	ТаблицаЦен.ЦенаРегл КАК ЦенаРегл,
	|	NULL КАК ОкруглятьВБольшуюСторону,
	|	NULL КАК Точность,
	|	0 КАК ПолеСортировки,
	|	ТаблицаЦен.ТипЦен.Рассчитывается КАК Рассчитывается,
	|	ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка) КАК ЦеноваяГруппа
	|ПОМЕСТИТЬ ВТ_ЦеныПодразделений
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТипыЦенПоВидамНоменклатуры.Ссылка,
	|	ТипыЦенПоВидамНоменклатуры.ВалютаЦены,
	|	ТипыЦенПоВидамНоменклатуры.БазоваяВалюта,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения,
	|	ТаблицаЦен.Подразделение,
	|	ТаблицаЦен.Цена + ТаблицаЦен.Цена * (ЕСТЬNULL(ТипыЦенПоВидамНоменклатуры.ПроцентСкидкиНаценкиТаблица, 0) / 100),
	|	ТаблицаЦен.ЦенаРегл,
	|	ТипыЦенПоВидамНоменклатуры.ОкруглятьВБольшуюСторону,
	|	ТипыЦенПоВидамНоменклатуры.Точность,
	|	1,
	|	ТаблицаЦен.ТипЦен.Рассчитывается,
	|	ЕСТЬNULL(ТипыЦенПоВидамНоменклатуры.ЦеноваяГруппа, ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка))
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен ЕСТЬ NULL
	|					ТОГДА ТипыЦен.БазовыйТипЦен
	|				ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен
	|			КОНЕЦ КАК БазовыйТипЦен,
	|			ВЫБОР
	|				КОГДА ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен ЕСТЬ NULL
	|					ТОГДА ТипыЦен.БазовыйТипЦен.ВалютаЦены
	|				ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен.ВалютаЦены
	|			КОНЕЦ КАК БазоваяВалюта,
	|			ТипыЦен.ВалютаЦены КАК ВалютаЦены,
	|			ТипыЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|			ТипыЦен.Точность КАК Точность,
	|			ВЫБОР
	|				КОГДА ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки ЕСТЬ NULL
	|					ТОГДА ТипыЦен.ПроцентСкидкиНаценки
	|				ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки
	|			КОНЕЦ КАК ПроцентСкидкиНаценкиТаблица,
	|			ТипыЦен.Ссылка КАК Ссылка,
	|			ЕСТЬNULL(ТипыЦенПроцентыСкидкиНаценки.ЦеноваяГруппа, ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)) КАК ЦеноваяГруппа
	|		ИЗ
	|			Справочник.ТипыЦен КАК ТипыЦен
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК ТипыЦенПроцентыСкидкиНаценки
	|				ПО (ТипыЦенПроцентыСкидкиНаценки.Ссылка = ТипыЦен.Ссылка)
	|					И (ТипыЦенПроцентыСкидкиНаценки.ЦеноваяГруппа = &ЦеноваяГруппа)) КАК ТипыЦенПоВидамНоменклатуры
	|		ПО ТаблицаЦен.ТипЦен = ТипыЦенПоВидамНоменклатуры.БазовыйТипЦен
	|ГДЕ
	|	ТаблицаЦен.Цена > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЦеныПодразделений.ТипЦен КАК ТипЦен,
	|	ВТ_ЦеныПодразделений.ВалютаЦены КАК ВалютаЦены,
	|	ВТ_ЦеныПодразделений.БазоваяВалюта КАК БазоваяВалюта,
	|	ВТ_ЦеныПодразделений.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ЦеныПодразделений.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ЦеныПодразделений.Подразделение КАК Подразделение,
	|	ВТ_ЦеныПодразделений.Цена КАК Цена,
	|	ВТ_ЦеныПодразделений.ЦенаРегл КАК ЦенаРегл,
	|	ВТ_ЦеныПодразделений.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	ВТ_ЦеныПодразделений.Точность КАК Точность,
	|	ВТ_ЦеныПодразделений.ПолеСортировки КАК ПолеСортировки,
	|	ВТ_ЦеныПодразделений.Рассчитывается КАК Рассчитывается,
	|	0 КАК ЦенаБезНДС,
	|	0 КАК ЦенаБезНДСРегл
	|ИЗ
	|	ВТ_ЦеныПодразделений КАК ВТ_ЦеныПодразделений
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолеСортировки,
	|	ТипЦен";
	
	#КонецОбласти
	
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.Добавить(Параметры.ПодразделениеКомпании);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	Запрос.УстановитьПараметр("ЦеноваяГруппа", Параметры.Номенклатура.ЦеноваяГруппа);
	ТаблицаЦены = Запрос.Выполнить().Выгрузить();
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Ставка = Параметры.Номенклатура.СтавкаНДС.Ставка;
	
	Для Каждого ТекСтрока Из ТаблицаЦены Цикл
		
		Если ТекСтрока.ВалютаЦены <> ТекСтрока.БазоваяВалюта Тогда
			
			ТекСтрока.Цена = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
				ТекСтрока.Цена,
				ТекСтрока.БазоваяВалюта,
				ТекущаяДатаСеанса(),
				ТекСтрока.ВалютаЦены,
				ТекущаяДатаСеанса());
		
		КонецЕсли;
		
		РежимОкругленияЦены = ?(ТекСтрока.ТипЦен.ОкруглятьВБольшуюСторону, 1, 0);
		ТекСтрока.Цена = Окр(ТекСтрока.Цена, ТекСтрока.ТипЦен.Точность, РежимОкругленияЦены);
		
		Если ВалютаРегламентированногоУчета <> Справочники.Валюты.ПустаяСсылка() Тогда
			
			Если ТекСтрока.ВалютаЦены = ВалютаРегламентированногоУчета Тогда
				
				ТекСтрока.ЦенаРегл = ТекСтрока.Цена;
				
			Иначе
				
				ТекСтрока.ЦенаРегл = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
					ТекСтрока.Цена,
					ТекСтрока.ВалютаЦены,
					ТекущаяДатаСеанса(),
					ВалютаРегламентированногоУчета,
					ТекущаяДатаСеанса());
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтрока.ТипЦен.ЦенаВключаетНДС Тогда
			
			ТекСтрока.ЦенаБезНДС     = ТекСтрока.Цена - Окр((ТекСтрока.Цена * Ставка)/(100 + Ставка), 2);
			ТекСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл - Окр((ТекСтрока.ЦенаРегл * Ставка)/(100 + Ставка), 2);
			
		Иначе
			
			ТекСтрока.ЦенаБезНДС     = ТекСтрока.Цена;
			ТекСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл;
			ТекСтрока.Цена           = ТекСтрока.Цена + Окр((ТекСтрока.Цена * Ставка)/100, 2);
			ТекСтрока.ЦенаРегл       = ТекСтрока.ЦенаРегл + Окр((ТекСтрока.ЦенаРегл * Ставка)/100, 2);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЦены), АдресРезультата);
	
КонецПроцедуры

// Цены номенклатуры контрагентов.
//
// Параметры:
//  Параметры - Структура - Описание параметров цен:
//    *Номенклатура - СправочникСсылка.Номенклатура - Номенклатура для которой получаются цены.
//  АдресРезультата - Строка - Адрес во временном хранилище для размещения цен номенклатуры.
//
Процедура ЦеныКонтрагентов(Параметры, АдресРезультата) Экспорт
	
	// Загрузка цен контрагентов
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                    |	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	                    |	ЦеныСрезПоследних.Контрагент КАК Контрагент,
						|	ЦеныСрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                    |	ВЫБОР
	                    |		КОГДА ЦеныСрезПоследних.ТипЦен.ВВалютеУчета = ИСТИНА
	                    |			ТОГДА ЦеныСрезПоследних.Номенклатура.ВалютаУчета
	                    |		ИНАЧЕ ЦеныСрезПоследних.ТипЦен.ВалютаЦены
	                    |	КОНЕЦ КАК ВалютаЦены,
	                    |	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                    |	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                    |	ЦеныСрезПоследних.ПодразделениеКомпании КАК Подразделение,
	                    |	ЦеныСрезПоследних.Цена КАК Цена,
	                    |	0 КАК ЦенаРегл
	                    |ПОМЕСТИТЬ ТаблицаЦен
	                    |ИЗ
	                    |	РегистрСведений.Цены.СрезПоследних(
	                    |			&НаДату,
	                    |			Номенклатура = &Номенклатура
	                    |				И Контрагент <> &Контрагент) КАК ЦеныСрезПоследних
	                    |ГДЕ
	                    |	ЦеныСрезПоследних.Цена > 0
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	ТаблицаЦен.Контрагент,
	                    |	ТаблицаЦен.ДоговорВзаиморасчетов,
	                    |	ТаблицаЦен.ТипЦен КАК ТипЦен,
	                    |	ТаблицаЦен.ВалютаЦены,
	                    |	ТаблицаЦен.ВалютаЦены КАК БазоваяВалюта,
	                    |	ТаблицаЦен.ХарактеристикаНоменклатуры,
	                    |	ТаблицаЦен.ЕдиницаИзмерения,
	                    |	ТаблицаЦен.Подразделение,
	                    |	ТаблицаЦен.Цена,
	                    |	ТаблицаЦен.ЦенаРегл,
	                    |	NULL КАК ОкруглятьВБольшуюСторону,
	                    |	NULL КАК Точность,
	                    |	0 КАК ПолеСортировки,
	                    |	ТаблицаЦен.ТипЦен.Рассчитывается КАК Рассчитывается
	                    |ИЗ
	                    |	ТаблицаЦен КАК ТаблицаЦен
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	ТаблицаЦен.Контрагент,
	                    |	ТаблицаЦен.ДоговорВзаиморасчетов,
	                    |	ТипыЦенПоВидамНоменклатуры.Ссылка,
	                    |	ТипыЦенПоВидамНоменклатуры.ВалютаЦены,
	                    |	ТипыЦенПоВидамНоменклатуры.БазоваяВалюта,
	                    |	ТаблицаЦен.ХарактеристикаНоменклатуры,
	                    |	ТаблицаЦен.ЕдиницаИзмерения,
	                    |	ТаблицаЦен.Подразделение,
	                    |	ТаблицаЦен.Цена + ТаблицаЦен.Цена * (ЕСТЬNULL(ТипыЦенПоВидамНоменклатуры.ПроцентСкидкиНаценкиТаблица, 0) / 100),
	                    |	ТаблицаЦен.ЦенаРегл,
	                    |	ТипыЦенПоВидамНоменклатуры.ОкруглятьВБольшуюСторону,
	                    |	ТипыЦенПоВидамНоменклатуры.Точность,
	                    |	1,
	                    |	ТаблицаЦен.ТипЦен.Рассчитывается
	                    |ИЗ
	                    |	ТаблицаЦен КАК ТаблицаЦен
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |			ВЫБОР
	                    |				КОГДА ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен ЕСТЬ NULL
	                    |					ТОГДА ТипыЦен.БазовыйТипЦен
	                    |				ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен
	                    |			КОНЕЦ КАК БазовыйТипЦен,
	                    |			ВЫБОР
	                    |				КОГДА ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен ЕСТЬ NULL
	                    |					ТОГДА ТипыЦен.БазовыйТипЦен.ВалютаЦены
	                    |				ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен.ВалютаЦены
	                    |			КОНЕЦ КАК БазоваяВалюта,
	                    |			ТипыЦен.ВалютаЦены КАК ВалютаЦены,
	                    |			ТипыЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	                    |			ТипыЦен.Точность КАК Точность,
	                    |			ВЫБОР
	                    |				КОГДА ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки ЕСТЬ NULL 
	                    |					ТОГДА ТипыЦен.ПроцентСкидкиНаценки
	                    |				ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки
	                    |			КОНЕЦ КАК ПроцентСкидкиНаценкиТаблица,
	                    |			ТипыЦен.Ссылка КАК Ссылка
	                    |		ИЗ
	                    |			Справочник.ТипыЦен КАК ТипыЦен
	                    |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК ТипыЦенПроцентыСкидкиНаценки
	                    |				ПО (ТипыЦенПроцентыСкидкиНаценки.Ссылка = ТипыЦен.Ссылка)
	                    |					И (ТипыЦенПроцентыСкидкиНаценки.ЦеноваяГруппа = &ЦеноваяГруппа)) КАК ТипыЦенПоВидамНоменклатуры
	                    |		ПО ТаблицаЦен.ТипЦен = ТипыЦенПоВидамНоменклатуры.БазовыйТипЦен
	                    |ГДЕ
	                    |	ТаблицаЦен.Цена > 0
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ПолеСортировки,
	                    |	ТипЦен");
	
	Запрос.УстановитьПараметр("НаДату",ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура",Параметры.Номенклатура);
	Запрос.УстановитьПараметр("ЦеноваяГруппа",Параметры.Номенклатура.ЦеноваяГруппа);
	Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
	
	ТаблицаЦеныКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Ставка = Параметры.Номенклатура.СтавкаНДС.Ставка;
	
	Для Каждого ТекСтрока Из ТаблицаЦеныКонтрагентов Цикл
		
		// для рассчетных типов цен перерасчет из валюты базового типа цен
		ТекСтрока.Цена = ?(ТекСтрока.ВалютаЦены <> ТекСтрока.БазоваяВалюта, РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Цена, ТекСтрока.БазоваяВалюта, ТекущаяДатаСеанса(), ТекСтрока.ВалютаЦены, ТекущаяДатаСеанса()), ТекСтрока.Цена);
		
		Если ТекСтрока.ТипЦен.ОкруглятьВБольшуюСторону Тогда
			ТекСтрока.Цена = Окр(ТекСтрока.Цена,ТекСтрока.ТипЦен.Точность,1);
		Иначе
			ТекСтрока.Цена = Окр(ТекСтрока.Цена,ТекСтрока.ТипЦен.Точность,0);
		КонецЕсли;
		
		Если ВалютаРегламентированногоУчета <> Справочники.Валюты.ПустаяСсылка() Тогда
			ТекСтрока.ЦенаРегл = ?(ТекСтрока.ВалютаЦены = ВалютаРегламентированногоУчета, ТекСтрока.Цена,
				РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Цена, ТекСтрока.ВалютаЦены, ТекущаяДатаСеанса(), ВалютаРегламентированногоУчета, ТекущаяДатаСеанса()))	
		КонецЕсли;
		
		//НоваяСтрока = ЦеныКонтрагентов.Добавить();
		//НоваяСтрока.Характеристика = ТекСтрока.ХарактеристикаНоменклатуры;
		//ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		//
		//Если ТекСтрока.ТипЦен.ЦенаВключаетНДС Тогда
		//	НоваяСтрока.ЦенаБезНДС     = ТекСтрока.Цена - Окр((ТекСтрока.Цена * Ставка)/(100 + Ставка), 2);
		//	НоваяСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл - Окр((ТекСтрока.ЦенаРегл * Ставка)/(100 + Ставка), 2);
		//Иначе
		//	НоваяСтрока.ЦенаБезНДС     = ТекСтрока.Цена;
		//	НоваяСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл;
		//	НоваяСтрока.Цена           = ТекСтрока.Цена + Окр((ТекСтрока.Цена * Ставка)/100, 2);
		//	НоваяСтрока.ЦенаРегл       = ТекСтрока.ЦенаРегл + Окр((ТекСтрока.ЦенаРегл * Ставка)/100, 2);
		//КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЦеныКонтрагентов), АдресРезультата);
	
КонецПроцедуры // ЦеныКонтрагентов()
// -- siniko

#КонецОбласти

#Область УсловноеОформление

// Добавление элементов условного оформления к списку номенклатуры.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма в которой располагается список.
//  ИмяСписка - Строка - Имя списка и элемента номенклатуры в форме.
//
Процедура УсловноеОформлениеСпискаНоменклатура(Форма, ИмяСписка="СписокНоменклатура") Экспорт
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Доступная номенклатура'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы[ИмяСписка].Имя);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.Доступно", ИмяСписка));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);
	
КонецПроцедуры

// Добавление элементов условного оформления к расширенному списку номенклатуры.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма в которой располагается список.
//  ИмяСписка - Строка - Имя списка и элемента номенклатуры в форме.
//
Процедура УсловноеОформлениеРасширенногоПоискаНоменклатуры(Форма, ИмяСписка="РасширенныйПоискСписокНоменклатура") Экспорт
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Номенклатура не существующая в базе данных'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы[ИмяСписка].Имя);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.Номенклатура", ИмяСписка));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры

#КонецОбласти

// Формирование списка вариантов поиска
//
// Параметры:
//  СписокВыбора - СписокВыбора - Список выбора элемента управления "переключатель вариантов выбора".
//
Процедура ЗаполнитьВыборВариантовПоиска(СписокВыбора) Экспорт
	
	СписокВыбора.Очистить();
	
	Для Каждого Вариант Из ПодборТоваровКлиентСервер.ВариантыПоиска() Цикл
		
		СписокВыбора.Добавить(Вариант.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Общий обработчик переноса товаров из корзины в документ для документов автосервиса.
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормыСтрктура - Документ для заполнения.
//  ТоварыОбъекта - ТабличнаяЧасть - Табличная часть товаров для заполнения.
//  Корзина - Массив - Товары подобранные на этапе подбора.
//  Контекст - Структура - Контекст добавления.
//
Процедура ЗаполнитьТоварыИзКорзиныВДокументахАвтосервиса(Объект, ТоварыОбъекта, Корзина, Контекст) Экспорт
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	Причина = ПолучитьЗначениеПараметраСтруктуры(Контекст, "ИдентификаторПричиныОбращения");
	ЕстьПричина = ЗначениеЗаполнено(Причина);
	ЕстьЦена = Не ТипЗнч(Корзина) = Тип("ТаблицаЗначений") ИЛИ ЕстьРеквизит(Корзина, "Цена");
	
	УсловиеПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения");
	
	Если ЕстьПричина Тогда
		
		УсловиеПоиска.Вставить("ИдентификаторПричиныОбращения", Причина);
		
	КонецЕсли;
	
	// Заблокируем пересчет скидок построчный
	ПараметрыДействия = Менеджер.ПолучитьПараметрыДействия(Объект);
	ПересчитыватьСкидки = Ложь;
	Если НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НеРассчитыватьСкидки", Ложь) Тогда
		ПересчитыватьСкидки = Истина;
		ПараметрыДействия.Вставить("НеРассчитыватьСкидки", Истина);
	КонецЕсли;
	
	Для Каждого Товар Из Корзина Цикл
		
		ЗаполнитьЗначенияСвойств(УсловиеПоиска, Товар);
		НайденныеПоУсловию = ТоварыОбъекта.НайтиСтроки(УсловиеПоиска);
		
		Если НЕ НайденныеПоУсловию.Количество() Тогда
			
			НовыйТовар = ТоварыОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
			
			Если ЕстьПричина Тогда
				
				НовыйТовар.ИдентификаторПричиныОбращения = Причина;
				
			КонецЕсли;
			
			Менеджер.ТоварыНоменклатураПриИзменении(Объект, НовыйТовар, ПараметрыДействия);
			
			Если ЕстьЦена И ЗначениеЗаполнено(Товар.Цена) И Товар.Цена <> НовыйТовар.Цена Тогда
				
				НовыйТовар.Цена = Товар.Цена;
				Менеджер.ТоварыЦенаПриИзменении(Объект, НовыйТовар);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		НовыйТовар = НайденныеПоУсловию[0];
		НовыйТовар.Количество = НовыйТовар.Количество + Товар.Количество;
		Менеджер.ТоварыКоличествоПриИзменении(Объект, НовыйТовар, ПараметрыДействия);
		
	КонецЦикла;
	
	// Пересчитаем скидки для табличной части
	Если ПересчитыватьСкидки Тогда
		ПараметрыДействия.Удалить("НеРассчитыватьСкидки");
		СкидкиНаценкиСервер.УстановитьСкидкиНаценки(Объект, ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьНомераСтрок(Таблица)
	
	НомерСтроки = 1;
	
	Для Каждого Строка Из Таблица Цикл
		
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти
